; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v3 - type_1 ?v4 - type_3)
 	      (pred_4 ?v1 - object ?v4 - type_3)
	      (pred_2 ?v3 - type_1 ?v8 - type_2)
	      (pred_3 ?v3 - type_1 ?v1 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v3 - type_1 ?v5 ?v2 - type_3)
       :precondition (and  (pred_1 ?v3 ?v5))
       :effect (and  (pred_1 ?v3 ?v2)
		     (not (pred_1 ?v3 ?v5))))

   (:action op_1
       :parameters (?v3 - type_1 ?v7 - object ?v6 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v6) (pred_1 ?v3 ?v6) (pred_2 ?v3 ?v8))
       :effect (and (pred_3 ?v3 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v6)) 
		    (not (pred_2 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_1 ?v7 - object ?v6 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v7 ?v8) (pred_1 ?v3 ?v6))
       :effect (and (pred_4 ?v7 ?v6)
		    (pred_2 ?v3 ?v8)
		    (not (pred_3 ?v3 ?v7 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_05 - type_1
obj_03 obj_11 obj_12 obj_01 - type_2
obj_06 obj_09 obj_02 - type_3
obj_04 obj_07 obj_08 - object)
(:init
(pred_1 obj_10 obj_06)
(pred_2 obj_10 obj_03)
(pred_2 obj_10 obj_11)
(pred_1 obj_05 obj_02)
(pred_2 obj_05 obj_12)
(pred_2 obj_05 obj_01)
(pred_4 obj_04 obj_09)
(pred_4 obj_07 obj_02)
(pred_4 obj_08 obj_02)
)
(:goal
(and
(pred_4 obj_04 obj_02)
(pred_4 obj_07 obj_09)
(pred_4 obj_08 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_10 obj_02)))
)
)

; plan
1. (op_3 obj_10 obj_06 obj_09)
   deleted: (pred_1 obj_10 obj_06)
   added: (pred_1 obj_10 obj_09)
   goals met: 0 of 3
2. (op_1 obj_05 obj_08 obj_02 obj_01)
   deleted: (pred_4 obj_08 obj_02) (pred_2 obj_05 obj_01)
   added: (pred_3 obj_05 obj_08 obj_01)
   goals met: 0 of 3
3. (op_1 obj_05 obj_07 obj_02 obj_12)
   deleted: (pred_4 obj_07 obj_02) (pred_2 obj_05 obj_12)
   added: (pred_3 obj_05 obj_07 obj_12)
   goals met: 0 of 3
4. (op_3 obj_05 obj_02 obj_09)
   deleted: (pred_1 obj_05 obj_02)
   added: (pred_1 obj_05 obj_09)
   goals met: 0 of 3
5. (op_1 obj_10 obj_04 obj_09 obj_11)
   deleted: (pred_4 obj_04 obj_09) (pred_2 obj_10 obj_11)
   added: (pred_3 obj_10 obj_04 obj_11)
   goals met: 0 of 3
6. (op_2 obj_05 obj_08 obj_09 obj_01)
   deleted: (pred_3 obj_05 obj_08 obj_01)
   added: (pred_4 obj_08 obj_09) (pred_2 obj_05 obj_01)
   goals met: 1 of 3
7. (op_2 obj_10 obj_04 obj_09 obj_11)
   deleted: (pred_3 obj_10 obj_04 obj_11)
   added: (pred_4 obj_04 obj_09) (pred_2 obj_10 obj_11)
   goals met: 1 of 3
8. (op_2 obj_05 obj_07 obj_09 obj_12)
   deleted: (pred_3 obj_05 obj_07 obj_12)
   added: (pred_4 obj_07 obj_09) (pred_2 obj_05 obj_12)
   goals met: 2 of 3
9. (op_1 obj_05 obj_04 obj_09 obj_01)
   deleted: (pred_4 obj_04 obj_09) (pred_2 obj_05 obj_01)
   added: (pred_3 obj_05 obj_04 obj_01)
   goals met: 2 of 3
10. (op_3 obj_05 obj_09 obj_02)
   deleted: (pred_1 obj_05 obj_09)
   added: (pred_1 obj_05 obj_02)
   goals met: 2 of 3
11. (op_2 obj_05 obj_04 obj_02 obj_01)
   deleted: (pred_3 obj_05 obj_04 obj_01)
   added: (pred_4 obj_04 obj_02) (pred_2 obj_05 obj_01)
   goals met: 3 of 3
